namespace Watcher;

/// <summary>
/// 主要记录非生物掉落物，非可制作物品的检测数据和一些需要特别判断的数据，如NPC售卖的东西
/// 其实这里的很多数据和生物掉落数据重复了，造成浪费资源检查的问题，但是计算机很强大不必在意这几个数据（我懒得重新整理了）
/// </summary>
public static class CheatData
{
    //蠕虫或脑子后，骷髅王前，因为一些奇怪的原因，这里记录鳞甲不记录组织样本（这两个boss掉落规则太怪了）
    public static HashSet<int> 邪恶Boss后_骷髅王前 = new HashSet<int>
    {
        117, 119, 120, 121, 122, 123, 124, 125, 127, 174, 175,197, 198, 199, 200, 201, 202, 203, 204, 217, 221, 231, 232, 233, 234, 3223, 3224, 3818, 3824, 3832, 3829
    };

    public static HashSet<int> 骷髅王后_肉山前 = new HashSet<int>
    {
        113, 151, 152, 153, 155, 156, 163, 164, 165, 218, 219, 220, 273, 274, 328, 329, 397, 890, 891, 904, 1263, 3019, 3245, 3317, 4703, 5010, 5126, 5325, 5328
    };

    public static HashSet<int> 肉山后_任意一个机械Boss前 = new HashSet<int>
    {
        435, 436, 481, 482, 483, 484, 496, 518, 519, 522, 533, 534, 776, 777, 778, 886, 888, 889, 892, 893, 991, 992, 993,
        1185, 1187, 1188, 1192, 1194, 1195, 1199, 1201, 1202, 1222, 1223,499,500,
        1224, 1332, 1336, 2270, 2331, 2366, 2551, 2750, 3209, 3210, 3211, 3283, 3289,
        3290, 3315, 3316, 3779, 3787, 3788, 4348, 4760, 4911, 371, 372,
        373, 374, 375, 376, 377, 378, 379, 380, 400, 401, 402, 403, 404,
        684, 685, 686, 1205, 1206, 1207, 1208, 1209, 1210, 1211, 1212, 1213,
        1214, 1215, 1216, 1217, 1218, 1219, 2370, 2371, 2372, 3773, 3774,
        3775, 3776, 3777, 3778, 5004, 364, 365, 366, 381, 382, 391, 415,
        416, 487, 502, 523, 524, 525, 1104, 1105, 1106, 1184, 1191, 1198,
        1220, 1221, 1591, 1593, 2701, 2751, 2752, 2753, 2754, 2755, 3064,
        3182, 3184, 3185, 3186, 3782, 3884, 3979, 3980, 3981, 3982, 3983,
        3984, 3985, 3986, 3987, 4406, 4408, 5003, 5135, 492, 493, 761, 785,
        822, 860, 862, 897, 901, 903, 1162, 1247, 1612, 1613, 2494, 3991,
        3992, 4001, 4002, 4006, 5355, 1171, 2429, 2209, 2422, 3335, 507,
        508, 520, 521, 531, 1347, 1348, 1432, 1533, 1534, 1535, 1536, 1537,
        3091, 3092, 4714, 4406, 4408, 5324, 5329, 5330, 5336, 515, 516, 545,
        546, 1334, 1335, 1351, 1352, 3009, 3010, 3011, 3103, 3104, 4091,
        1528, 1529, 1530, 1531, 1532, 4712, 4713, 3679, 3680, 3681, 3682, 3683, 3781
    };

    public static HashSet<int> 任意一个机械Boss后 = new HashSet<int>
    {
        368, 494, 495, 506, 533, 550, 561, 578, 756, 787, 2535, 3284, 3286, 3819,
        3825, 3830, 3833, 4060, 4678, 4790, 551, 552, 553, 558, 559, 3797,
        3798, 3799, 3800, 3801, 3802, 3803, 3804, 3805, 3806, 3807, 3808,
        4873, 4896, 4897, 4898, 4899, 4900, 4901, 425, 783, 1291, 3354,
        3355, 3356, 5338, 749, 821, 1165, 1515
    };

    public static HashSet<int> 所有机械Boss后_世花前 = new HashSet<int>
    {
        579, 674, 675, 2223,
        990, 1226, 1227, 1228, 1229, 1230, 1231, 1232, 1233, 1234, 1235,
        2188, 1001, 1002, 1003, 1004, 1005, 1006, 935, 936, 1343,
        2220, 947, 1179, 3353, 5289, 5296
    };

    public static HashSet<int> 世纪之花后_石巨人前 = new HashSet<int>
    {
        760, 771, 772, 773, 774,
        1156, 1260, 1506, 1507, 1569, 1571, 1572, 2176, 3291, 4607,
        1159, 1160, 1161, 1503, 1504, 1505, 1546, 1547, 1548, 1549, 1550,
        1743, 1744, 1745, 1832, 1833, 1834, 2189, 823, 984, 1167, 1797,
        1830, 1864, 1866, 3336, 3997, 3998, 4005, 4409, 1339, 1340, 1341,
        1342, 1346, 1350, 1357, 1543, 1544,
        1545, 1551, 1552, 1606, 1730, 1783, 1785, 1814, 1815, 1816, 1817,
        1818, 1836, 1844, 1958, 1963, 1965, 3108, 3261,
        4392, 4445, 4446, 4447, 4448, 4449, 4457, 4458, 4459,
        4731, 5291, 5292, 5344, 5345, 5451, 5452
    };

    public static HashSet<int> 石巨人后_邪教徒前 = new HashSet<int>
    {
        948, 3820, 3826, 3831, 3834, 2199, 2200, 2201, 2202, 3871, 3872, 3873, 3874, 3875,
        3876, 3877, 3878, 3879, 3880, 3881, 3882, 1301, 1858, 1865, 2280,
        3110, 4005, 1261, 1292, 3337
    };

    public static HashSet<int> 月亮领主后 = new HashSet<int>
    {
        2774, 2775, 2776, 2777, 2778,
        2779, 2780, 2781, 2782, 2783, 2784, 2785, 2786, 3462, 3463, 3464,
        3465, 3466, 3522, 3523, 3524, 3525, 2760, 2761, 2762, 2757,
        2758, 2759, 2763, 2764, 2765, 3381, 3382, 3383, 4318, 4951, 3467,
        3461, 5401, 5402, 5403, 5404, 5405, 5406, 5407, 5408, 5409, 5410,
        5411, 5412, 5413, 5414, 5415, 5416, 3468, 3469, 3470, 3471, 4954,
        1131, 2768, 3567, 3568, 3577, 3530, 5335, 5364, 5134, 5392, 5393,
        5394
    };

    public static HashSet<int> Dye = new HashSet<int>
    {
        3038,3039,3042,3533,3561,3597,3598,3600
    };


    //拿持日志中不需要记录的豁免物品
    public static HashSet<int> ImmunityHoldItems = Watcher.config.拿持日志中的豁免物品ID.Keys.ToHashSet();

    //丢弃日志中不需要记录的豁免物品
    public static HashSet<int> ImmunityDropItems = Watcher.config.丢弃日志中的豁免物品ID.Keys.ToHashSet();

    //射弹日志中需要记录的危险的射弹物
    public static HashSet<int> DangerousProjectile = Watcher.config.射弹日志中需要记录的危险的射弹物ID.Keys.ToHashSet();

    //正常的蒸汽朋克。为了区别彩蛋图的原因
    public static HashSet<int> Steampunker1 = new HashSet<int>
    {
        748, 779, 839, 840, 841, 995, 2193, 4142, 780, 782, 784, 1344, 4472, 1742, 948, 3623, 3602, 3603, 3604, 3605, 3606, 3607, 3608, 3609, 3610
    };

    //十周年蒸汽朋克，肉前，不同于正常蒸汽朋克的部分
    public static HashSet<int> Steampunker2 = new HashSet<int>
    {
        748, 1344, 4472, 948, 3623
    };

    /// <summary>
    ///全局npc检查应该排除的物品，如礼物，木箭，火把等
    ///这里装的是 既可以npc掉落也可以用其他方式获得的物品，不要塞错了
    /// 主要来源于：木箭僵尸，火把僵尸，水母，宝箱怪，丛林宝箱怪，蒲公英怪，岩石巨人，花岗岩精等等
    ///NPC掉落检查将不再检查这里的物品
    /// </summary>
    public static HashSet<int> AllNPCLootExclude = new HashSet<int>
    {
        //正常途径可以其他方式获取的,如购买，砸罐子，微光，宝匣
        3,8,40,52,56,57,75,88,116,166,215,282,307,313,327,499,500,522,593,678,880,885,886,888,889,890,892,893,1257,1332,1336,1724,1774,1869,1922,2272,2353,2676,3086,3109,3199,3380,3532,3544,3781,5395,
        //彩蛋种子等可以其他方式获取的
        112,157,662,671,683,2273,2623,3069,5147,   
        //冰雪宝箱怪，霜印剑，寒霜之花，冰雪弓， 疾风雪靴，暴雪瓶，冰刀，溜冰靴，雪球炮，冰雪回旋镖（未排序）
        676,725,1264,1319,670,1579,987,950,724,
        //普通宝箱怪，双钩，魔法飞刀，点金石，泰坦手套，星星斗篷，十字项链，火花魔棒，再生手环，魔镜，云朵瓶，赫尔鞋子，链锤，鞋钉(排了)
        437,517,535,536,532,554,3069,49,50,53,54,5011,975,
        //城镇npc掉落物,因为敌怪或陷阱不算做玩家杀死,共鸣法杖在其他地方特殊判断了
        260,867,2222,3349,3350,3351,3352,3548,3821,4372,4818,5065,5290,
        //四柱碎片
        3456,3457,3458,3459
    };

    /// <summary>
    ///全局配方检查时应该排除的物品，如敲罐子获得的火把可制作但凝胶未必可获得
    ///这里装的是全局配方检查不合理但游戏进度允许的物品
    /// 如火把可以制作也可以罐子敲出或购买，配方凝胶木头，未击败史莱姆而获得火把会因为凝胶残缺而显示作弊，所以要去掉火把
    ///配方检查将不再检查这里的物品
    /// </summary>
    public static HashSet<int> AllRecipeExclude = new HashSet<int>
    {
        43,47,214,226,227,265,295,300,302,303,304,305,333,499,556,642,857,987,1349,2245,2322,2326,2385,2548,2565,3067,3142,3143,3456,3457,3458,3459,
        4310,4423,4533,4534,4535,4536,4745,5092
    };
    
    /// <summary>
    ///全局配方检查时应该排除的物品的材料，如敲罐子获得的火把可制作但凝胶未必可获得
    ///这里装的是全局配方检查不合理但游戏进度允许的物品的配方材料，注意是物品的配方材料，不是物品，因为全局配方检查主要看材料是否合理
    /// 如火把可以制作也可以罐子敲出或购买，配方凝胶木头，未击败史莱姆而获得火把会因为凝胶残缺而显示作弊，所以要去掉凝胶
    /// </summary>
    public static HashSet<int> AllRecipeExcludeMaterial = new HashSet<int>
    {
        23//我就找到一个 :D
    };

    /// <summary>
    /// 开发者时装
    /// </summary>
    public static HashSet<int> 开发者时装 = new HashSet<int>
    {
        665,666,667,668,1554,1555,1556,1557,1558,1559,1560,1561,1562,1563,1564,1565,1566,1567,1568,1580,1581,1582,1583,1584,1585,1586,1587,1588,3024,3226,3227,3228,3287,3288,3368,3578,3579,3580,
        3581,3582,3583,3585,3586,3587,3588,3589,3590,3591,3592,3599,3921,3922,3923,3924,3925,3926,3927,3928,3929,4746,4747,4748,4749,4750,4751,4752,4753,4754,4755,4756,4757
    };


    public static HashSet<int> 浮标射弹 = new HashSet<int>
    {
        360,361,362,363, 364,365,366,381, 382,760,775,986, 987,988,989,990, 991,992,993
    };
}
